app/Controllers/Recruitment/RecruitmentController.php

SELECT *
FROM `rc_positions`
SELECT *
FROM `departments`
---
    public function index()
    {
        $current_user = $this->session->get('current_user');

        if (!in_array($current_user['role'], ['superuser', 'hr', 'manager', 'hod', 'tl'])) {

            return redirect()->to(base_url('/unauthorised'));
        }



        $positionModel = new RcPositionModel();
        $companyModel = new CompanyModel();
        $employeeModel = new EmployeeModel();
        $departmentModel = new DepartmentModel();
        $position = $positionModel->findAll();
        $companies = $companyModel->getAllCompanies();
        $employees = $this->getAllEmployees();
        $departments = $departmentModel->findAll();

SELECT `employees`.`id` as `id`, `employees`.`internal_employee_id` as `internal_employee_id`, trim( concat( employees.first_name, " ", employees.last_name ) ) as employee_name, `companies`.`company_short_name` as `company_short_name`, `departments`.`department_name` as `department_name`
FROM `employees`
LEFT JOIN `companies` as `companies` ON `companies`.`id` = `employees`.`company_id`
LEFT JOIN `departments` as `departments` ON `departments`.`id` = `employees`.`department_id`
WHERE   (
`employees`.`date_of_leaving` is null
OR `employees`.`date_of_leaving` >= ('2025-12-27')
 )
ORDER BY `employees`.`first_name` ASC
---
    public function getAllEmployees()
    {
        $EmployeeModel = new EmployeeModel();
        $date_45_days_before = date('Y-m-d', strtotime('-45 days'));
        $EmployeeModel
            ->select('employees.id as id')
            ->select('employees.internal_employee_id as internal_employee_id')
            ->select('trim( concat( employees.first_name, " ", employees.last_name ) ) as employee_name, ')
            ->select('companies.company_short_name as company_short_name')
            ->select('departments.department_name as department_name')
            ->join('companies as companies', 'companies.id = employees.company_id', 'left')
            ->join('departments as departments', 'departments.id = employees.department_id', 'left')
            ->groupStart()
            ->where('employees.date_of_leaving is null')
            ->orWhere("employees.date_of_leaving >= ('" . $date_45_days_before . "')")
            ->groupEnd()
            ->orderBy('employees.first_name', 'ASC');
        $AllEmployees = $EmployeeModel->findAll();

SELECT `job_listing_id`
FROM `rc_job_listing_notifications`
WHERE `user_id` = '40'
AND `read_at` IS NULL
---
    public function getJobListingNotifications()
    {
        $currentUserId = $this->session->get('current_user')['employee_id'];
        $allPendingJobs = [];

        $notifiedJobIds = $this->jobListingNotificationModel
            ->where('user_id', $currentUserId)
            ->where('read_at IS NULL')
            ->findColumn('job_listing_id');