app/Controllers/User/Profile.php

SELECT *
FROM `employees`
WHERE `employees`.`id` = '40'
SELECT *
FROM `probation_notifications`
WHERE `employee_id` = '40'
AND `probation_notifications`.`deleted_at` IS NULL
 LIMIT 1
---
    public function ProbationCompletedNotificationModel()
    {
        $employee_id = $this->session->get('current_user')['employee_id'];

        $EmployeeModel = new EmployeeModel();
        $employee = $EmployeeModel->find($employee_id);

        if (!$employee) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Employee not found.']);
        }

        $probation_period = $employee['probation']; // e.g., '45 Days Probation', '90 Days Probation'
        $joining_date = new \DateTime($employee['joining_date']);
        $today = new \DateTime();

        $probation_days = (int) filter_var($probation_period, FILTER_SANITIZE_NUMBER_INT);


        if ($probation_period == 'confirmed') {
            $probation_end_date = $joining_date->add(new \DateInterval("P{$probation_days}D"));

            if ($today >= $probation_end_date) {
                $ProbationNotificationModel = new ProbationNotificationModel();
                $notification = $ProbationNotificationModel->where('employee_id', $employee_id)->first();

SELECT *
FROM `grace_balance`
WHERE `employee_id` = '40'
AND `year_month` = '2026-01'
 LIMIT 1
---
            function ($value) {
                return $value;
            }
        );
        $balance_grace_row = $GraceBalanceModel->where('employee_id', $current_user['employee_id'])->where('year_month', date('Y-m'))->first();

SELECT `od_requests`.*, trim(concat(e.first_name, " ", e.last_name)) as assigned_by, trim(concat(e1.first_name, " ", e1.last_name)) as reviewed_by_name
FROM `od_requests`
LEFT JOIN `employees` `e` ON `e`.`id` = `od_requests`.`duty_assigner`
LEFT JOIN `employees` `e1` ON `e1`.`id` = `od_requests`.`reviewed_by`
WHERE `od_requests`.`status` = 'pending'
AND `od_requests`.`employee_id` = '40'
AND (
                                    date(od_requests.estimated_from_date_time) >= "2026-01-01"
                                    or date(od_requests.estimated_to_date_time) >= "2026-01-01"
                                    or date(od_requests.actual_from_date_time) >= "2026-01-01"
                                    or date(od_requests.actual_to_date_time) >= "2026-01-01"
                                )
ORDER BY `od_requests`.`estimated_from_date_time` DESC
---
    public function getOdReportsPending()
    {
        $current_user = $this->session->get('current_user');
        $OdRequestsModel = new OdRequestsModel();
        $current_user_data = $OdRequestsModel
            ->select('od_requests.*')
            ->select('trim(concat(e.first_name, " ", e.last_name)) as assigned_by')
            ->select('trim(concat(e1.first_name, " ", e1.last_name)) as reviewed_by_name')
            ->join('employees e', 'e.id = od_requests.duty_assigner', 'left')
            ->join('employees e1', 'e1.id = od_requests.reviewed_by', 'left')
            ->where('od_requests.status =', 'pending')
            ->where('od_requests.employee_id =', $current_user['employee_id'])
            ->where('(
                                    date(od_requests.estimated_from_date_time) >= "' . first_date_of_month() . '"
                                    or date(od_requests.estimated_to_date_time) >= "' . first_date_of_month() . '"
                                    or date(od_requests.actual_from_date_time) >= "' . first_date_of_month() . '"
                                    or date(od_requests.actual_to_date_time) >= "' . first_date_of_month() . '"
                                )')
            ->orderBy('od_requests.estimated_from_date_time', 'DESC')
            ->findAll();

SELECT `employees`.`id` as `employee_id`, trim(concat(employees.first_name, ' ', employees.last_name)) as employee_name, CONCAT(
                LPAD(DAY(joining_date), 2, '0'), CASE
                    WHEN DAY(employees.joining_date) IN (1, 21, 31) THEN '<sup>st</sup>'
                    WHEN DAY(employees.joining_date) IN (2, 22) THEN '<sup>nd</sup>'
                    WHEN DAY(employees.joining_date) IN (3, 23) THEN '<sup>rd</sup>'
                    ELSE '<sup>th</sup>'
                END, ' ', DATE_FORMAT(employees.joining_date, '%b %Y')
            ) AS formatted_joining_date, `employees`.`joining_date` as `joining_date_unformatted`
FROM `employees`
WHERE `employees`.`status` = 'active'
AND `employees`.`joining_date` >= '2026-01-31'
AND `employees`.`id` not in (select employee_id from welcome_email_history)
ORDER BY `employees`.`id` ASC
---
    public function getEmployeesWaitingforWelcome()
    {
        $oneMonthBefore =  date('Y-m-d', strtotime("-1 month"));
        $tenDaysBefore =  date('Y-m-d', strtotime("-10 days"));
        $EmployeeModel = new EmployeeModel();
        $EmployeeModel->select("employees.id as employee_id");
        $EmployeeModel->select("trim(concat(employees.first_name, ' ', employees.last_name)) as employee_name");
        $EmployeeModel->select("CONCAT(
                LPAD(DAY(joining_date), 2, '0'),
                CASE
                    WHEN DAY(employees.joining_date) IN (1, 21, 31) THEN '<sup>st</sup>'
                    WHEN DAY(employees.joining_date) IN (2, 22) THEN '<sup>nd</sup>'
                    WHEN DAY(employees.joining_date) IN (3, 23) THEN '<sup>rd</sup>'
                    ELSE '<sup>th</sup>'
                END,
                ' ',
                DATE_FORMAT(employees.joining_date, '%b %Y')
            ) AS formatted_joining_date,");
        $EmployeeModel->select("employees.joining_date as joining_date_unformatted");
        $EmployeeModel->where("employees.status =", 'active');
        $EmployeeModel->where("employees.joining_date >=", $tenDaysBefore);
        $EmployeeModel->where("employees.id not in (select employee_id from welcome_email_history)");
        $EmployeeModel->orderBy("employees.id", "ASC");
        $data = $EmployeeModel->findAll();