app/Helpers/Config_defaults_helper.php

SELECT *
FROM `employees`
WHERE `internal_employee_id` = '588'
 LIMIT 1
---
    function get_punching_data($empCode = 'ALL', $from_date = '', $to_date = '')
    {
        $EmployeeModel = new \App\Models\EmployeeModel;
        $employeeData = $EmployeeModel->where('internal_employee_id =', $empCode)->first();

SELECT *
FROM `employees`
WHERE `internal_employee_id` = '588'
 LIMIT 1
SELECT *
FROM `manual_punches`
WHERE `employee_id` = '40'
AND `punch_date` = '2025-12-31'
 LIMIT 1
---
    function get_punching_data_with_override($empCode = null, $from_date = '', $to_date = '')
    {
        if (empty($empCode)) {
            return json_encode(['InOutPunchData' => []]);
        }

        $EmployeeModel = new \App\Models\EmployeeModel;
        $employeeData = $EmployeeModel->where('internal_employee_id =', $empCode)->first();
        $employee_id = $employeeData['id'];

        if (empty($from_date)) {
            $from_date = date('Y-m-d', strtotime(current_date_of_month()));
        }
        if (empty($to_date)) {
            $to_date = date('Y-m-d', strtotime(current_date_of_month()));
        }
        $RawPunchingDataModel = new \App\Models\RawPunchingDataModel;
        $RawPunchingDataModel->where('Empcode =', $empCode);
        $RawPunchingDataModel->where('(DateString_2 between "' . $from_date . '" and "' . $to_date . '")');
        // $RawPunchingData = $RawPunchingDataModel->findAll() ?? complete_raw_data($employeeData, $from_date, $to_date);
        $RawPunchingData = $RawPunchingDataModel->findAll() ?? [];
        $RawPunchingData = !empty($RawPunchingData) ? $RawPunchingData : complete_raw_data($employeeData, $from_date, $to_date);

        // if ($from_date == '2025-04-01') {
        //     dd($RawPunchingData);
        // }

        foreach ($RawPunchingData as $key => $val) {
            $date = $val['DateString_2'];
            $ManualPunchModel = new \App\Models\ManualPunchModel();
            $manualPunchData = $ManualPunchModel->where('employee_id =', $employee_id)->where('punch_date =', $date)->first();

SELECT `machine_override`.*, `machine_override`.`machine` as `override_machine`, `employees`.`internal_employee_id` as `internal_employee_id`, `employees`.`machine` as `default_machine`
FROM `machine_override`
LEFT JOIN `employees` ON `employees`.`id`=`machine_override`.`employee_id`
WHERE   (
`machine_override`.`from_date` between '2026-01-01' and '2026-01-31'
OR `machine_override`.`to_date` between '2026-01-01' and '2026-01-31'
OR '2026-01-01' between `machine_override`.`from_date` and machine_override.to_date
OR '2026-01-31' between `machine_override`.`from_date` and machine_override.to_date
 )
---
    function get_raw_punching_data($employee_id = 'ALL', $from_date = '', $to_date = '')
    {
        if (empty($from_date)) {
            $from_date = date('Y-m-d', strtotime(current_date_of_month()));
        }
        if (empty($to_date)) {
            $to_date = date('Y-m-d', strtotime(current_date_of_month()));
        }
        #######Find overridden Machines#######
        $MachineOverrideModel = new \App\Models\MachineOverrideModel;
        $MachineOverrideModel->select('machine_override.*');
        $MachineOverrideModel->select('machine_override.machine as override_machine');
        $MachineOverrideModel->select('employees.internal_employee_id as internal_employee_id');
        $MachineOverrideModel->select('employees.machine as default_machine');
        $MachineOverrideModel->join('employees', 'employees.id=machine_override.employee_id', 'left');
        $MachineOverrideModel->groupStart();
        $MachineOverrideModel->where("machine_override.from_date between '" . $from_date . "' and '" . $to_date . "'");
        $MachineOverrideModel->orWhere("machine_override.to_date between '" . $from_date . "' and '" . $to_date . "'");
        $MachineOverrideModel->orWhere("'" . $from_date . "' between machine_override.from_date and machine_override.to_date");
        $MachineOverrideModel->orWhere("'" . $to_date . "' between machine_override.from_date and machine_override.to_date");
        $MachineOverrideModel->groupEnd();
        $ExistingMachineOverrideEntries = $MachineOverrideModel->findAll();

SELECT `employees`.`internal_employee_id` as `internal_employee_id`, `employees`.`machine` as `default_machine`, `employees`.`id` as `emp_id`
FROM `employees`
WHERE `employees`.`internal_employee_id` = '588'
---
        if ($employee_id !== 'ALL') {
            $EmployeeModel->where('employees.internal_employee_id =', $employee_id);
        }
        $DefaultMachineEntries_raw = $EmployeeModel->findAll();

SELECT `employees`.`internal_employee_id` as `internal_employee_id`, `employees`.`joining_date` as `joining_date`, `employees`.`date_of_leaving` as `date_of_leaving`
FROM `employees`
WHERE `employees`.`internal_employee_id` = '588'
---
        if ($employee_id !== 'ALL') {
            $EmployeeModel->where('employees.internal_employee_id =', $employee_id);
        }
        $JoiningDates_raw = $EmployeeModel->findAll();

SELECT *
FROM `grace_balance`
WHERE `employee_id` = '40'
AND `year_month` = '2026-01'
 LIMIT 1
---
    function getBalanceGrace()
    {
        $employee_id = session()->get('current_user')['employee_id'];
        $GraceBalanceModel = new \App\Models\GraceBalanceModel();
        $balance_grace_row = $GraceBalanceModel->where('employee_id', $employee_id)->where('year_month', date('Y-m'))->first();

SELECT `pre_final_paid_days`.`late_coming_minutes`, `pre_final_paid_days`.`in_time_between_shift_with_od`
FROM `pre_final_paid_days`
WHERE `pre_final_paid_days`.`employee_id` = '40'
AND (`pre_final_paid_days`.`date` between '2026-01-03' and '2026-01-10')
ORDER BY `date` DESC
---
    function getLateMinutes($from, $to)
    {
        $employee_id = session()->get('current_user')['employee_id'];
        $PreFinalPaidDaysModel = new \App\Models\PreFinalPaidDaysModel;
        $get_punching_data = $PreFinalPaidDaysModel
            ->select('pre_final_paid_days.late_coming_minutes')
            ->select('pre_final_paid_days.in_time_between_shift_with_od ')
            ->where('pre_final_paid_days.employee_id =', $employee_id)
            ->where("(pre_final_paid_days.date between '" . $from . "' and '" . $to . "')")
            ->orderBy('date', 'desc')
            ->findAll();

SELECT `pre_final_paid_days`.`early_going_minutes`, `pre_final_paid_days`.`in_time_between_shift_with_od`
FROM `pre_final_paid_days`
WHERE `pre_final_paid_days`.`employee_id` = '40'
AND (`pre_final_paid_days`.`date` between '2026-01-03' and '2026-01-10')
---
    function getEarlyGoingMinutes($from, $to)
    {
        $employee_id = session()->get('current_user')['employee_id'];
        $PreFinalPaidDaysModel = new \App\Models\PreFinalPaidDaysModel;
        $get_punching_data = $PreFinalPaidDaysModel
            ->select('pre_final_paid_days.early_going_minutes')
            ->select('pre_final_paid_days.in_time_between_shift_with_od')
            ->where('pre_final_paid_days.employee_id =', $employee_id)
            ->where("(pre_final_paid_days.date between '" . $from . "' and '" . $to . "')")
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `rc_job_listing`
JOIN `departments` ON `departments`.`id` = `rc_job_listing`.`department_id`
WHERE `rc_job_listing`.`status` NOT IN ('closed','rejected','draft')
AND `departments`.`hod_employee_id` = '40'
AND `rc_job_listing`.`approved_by_hr_executive` IS NOT NULL
AND `rc_job_listing`.`approved_by_hod` IS NULL
---
    function getPendingApprovalCounts()
    {
        $current_user = session()->get('current_user');
        $current_user_id = $current_user['employee_id'];
        $total_pending = 0;

        $jobListingModel = new \App\Models\Recruitment\RcJobListingModel();
        $baseQuery = function () use ($jobListingModel) {
            return $jobListingModel->whereNotIn('rc_job_listing.status', ['closed', 'rejected', 'draft']);
        };

        if ($current_user_id == 52) {
            $total_pending += $baseQuery()
                ->where('rc_job_listing.approved_by_hr_executive IS NULL')
                ->countAllResults();
        }

        $hod_pending_count = $baseQuery()
            ->join('departments', 'departments.id = rc_job_listing.department_id')
            ->where('departments.hod_employee_id', $current_user_id)
            ->where('rc_job_listing.approved_by_hr_executive IS NOT NULL')
            ->where('rc_job_listing.approved_by_hod IS NULL')
            ->countAllResults();
        $total_pending += $hod_pending_count;

        if ($current_user_id == 293) {
            $total_pending += $baseQuery()
                ->where('rc_job_listing.approved_by_hr_executive IS NOT NULL')
                ->where('rc_job_listing.approved_by_hod IS NOT NULL')
                ->where('rc_job_listing.approved_by_hr_manager IS NULL')
                ->countAllResults();