app/Helpers/Config_defaults_helper.php

SELECT `pre_final_paid_days`.`early_going_minutes`, `pre_final_paid_days`.`in_time_between_shift_with_od`
FROM `pre_final_paid_days`
WHERE `pre_final_paid_days`.`employee_id` = '40'
AND (`pre_final_paid_days`.`date` between '2026-01-03' and '2026-01-10')
---
    function getEarlyGoingMinutes($from, $to)
    {
        $employee_id = session()->get('current_user')['employee_id'];
        $PreFinalPaidDaysModel = new \App\Models\PreFinalPaidDaysModel;
        $get_punching_data = $PreFinalPaidDaysModel
            ->select('pre_final_paid_days.early_going_minutes')
            ->select('pre_final_paid_days.in_time_between_shift_with_od')
            ->where('pre_final_paid_days.employee_id =', $employee_id)
            ->where("(pre_final_paid_days.date between '" . $from . "' and '" . $to . "')")
            ->findAll();