app/Pipes/AttendanceProcessor/ApplyManualPunching.php

    public function handle($punching_row, Closure $next)
    {
        $employee_id = $punching_row['current_user_data']['id'];
        $date = $punching_row['date'];
        $ManualPunchModel = new ManualPunchModel();
        $manualPunchData = $ManualPunchModel->where('employee_id =', $employee_id)->where('punch_date =', $date)->first();
---
SELECT *
FROM `manual_punches`
WHERE `employee_id` = '40'
AND `punch_date` = '2026-01-01'
 LIMIT 1