app/Pipes/AttendanceProcessor/ProcessorHelper.php

SELECT *
FROM `holidays`
WHERE `holiday_date` = '2026-01-01'
AND `holiday_code` != 'RH'
AND `holiday_code` != 'SPL HL'
 LIMIT 1
---
    public static function is_holiday($date, $returnType = 'data', $machine = null, $company_id = null)
    {
        $reject_array = array(
            array(
                'machine' => 'hn',
                'company_id' => '4',
                'date' => '2023-09-07',
            ),
        );

        foreach ($reject_array as $reject) {
            if (
                isset($machine) && !empty($machine)
                && isset($company_id) && !empty($company_id)
                && $reject['machine'] == $machine && $reject['company_id'] == $company_id && $reject['date'] == $date
            ) {
                if ($returnType !== 'data') {
                    return 'no';
                } else {
                    return null;
                }
            }
        }

        $HolidayModel = new HolidayModel();
        $TheHoliday = $HolidayModel->where('holiday_date =', $date)->where('holiday_code !=', 'RH')->where('holiday_code !=', 'SPL HL')->first();

SELECT *
FROM `comp_off_minutes_utilized`
WHERE `employee_id` = '40'
AND `type` = 'utilized'
AND `date` = '2026-01-01'
 LIMIT 1
---
    public static function get_comp_off_minutes($employee_id, $date)
    {
        $CompOffMinutesUtilizedModel = new CompOffMinutesUtilizedModel();
        $get_comp_off_minutes = $CompOffMinutesUtilizedModel
            ->where('employee_id =', $employee_id)
            ->where('type =', 'utilized')
            ->where('date =', $date)
            ->first();

SELECT *
FROM `waveoffhalfdaywhodidnotworkforhalfday`
WHERE `employee_id` = '40'
AND `date` = '2026-01-01'
 LIMIT 1
---
    public static function get_wave_off_half_day_who_did_not_work_for_half_day($employee_id, $date)
    {
        $WaveOffHalfDayWhoDidNotWorkForHalfDayModel = new WaveOffHalfDayWhoDidNotWorkForHalfDayModel();
        $wave_off_half_day_who_did_not_work_for_half_day = $WaveOffHalfDayWhoDidNotWorkForHalfDayModel->where('employee_id =', $employee_id)->where('date =', $date)->first();

SELECT *
FROM `waveoffhalfdaywhodidnotworkforhalfday`
WHERE `employee_id` = '40'
AND `date` = '2026-01-01'
 LIMIT 1
---
    public static function get_wave_off_half_day_who_did_not_work_for_half_day_remarks($employee_id, $date)
    {
        $WaveOffHalfDayWhoDidNotWorkForHalfDayModel = new WaveOffHalfDayWhoDidNotWorkForHalfDayModel();
        $wave_off_half_day_who_did_not_work_for_half_day_remarks = $WaveOffHalfDayWhoDidNotWorkForHalfDayModel->where('employee_id =', $employee_id)->where('date =', $date)->first();

SELECT *
FROM `od_requests`
WHERE `employee_id` = '40'
AND `status` = 'approved'
AND 
                        (
                            ( date(estimated_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(estimated_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or (date(actual_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(actual_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
---
    public static function get_od_hours_between_shifts($date, $shift_start__Raw, $shift_end__Raw, $employee_id, $returnType = 'hours')
    {
        $OdRequestsModel = new OdRequestsModel();
        $ods    = $OdRequestsModel
            ->where('employee_id =', $employee_id)
            ->where('status =', 'approved')
            ->where("
                        (
                            ( date(estimated_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(estimated_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( date(actual_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(actual_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
                    ")
            ->findAll();

SELECT *
FROM `shifts`
WHERE `shifts`.`id` = '1'
---
    public static function is_weekoff($shift_id, $date)
    {
        $ShiftModel = new ShiftModel();
        $shiftData = $ShiftModel->find($shift_id);

SELECT *
FROM `holidays`
WHERE `holiday_date` = '2026-01-01'
AND `holiday_code` = 'SPL HL'
 LIMIT 1
---
    public static function is_special_holiday($date, $employee_id, $returnType = 'data')
    {
        $HolidayModel = new HolidayModel();
        $TheHoliday = $HolidayModel->where('holiday_date =', $date)->where('holiday_code =', 'SPL HL')->first();

SELECT `rh_id` as `rh_id`
FROM `fixed_rh`
WHERE `fixed_rh`.`employee_id` = '40'
AND `fixed_rh`.`year` = '2026'
---
    public static function is_RH($date, $employee_id)
    {
        $FixedRhModel = new FixedRhModel();
        $FixedRhModel
            ->select("rh_id as rh_id")
            ->where("fixed_rh.employee_id =", $employee_id)
            ->where("fixed_rh.year =", date('Y', strtotime($date)));
        $MYRHids = $FixedRhModel->findAll();

SELECT `employees`.`second_saturday_fixed_off` as `second_saturday_fixed_off`
FROM `employees`
WHERE `employees`.`id` = '40'
 LIMIT 1
---
    public static function is_fixed_off($date, $employee_id)
    {
        $EmployeeModel = new EmployeeModel();
        $FixedSaturdayOff = $EmployeeModel
            ->select('employees.second_saturday_fixed_off as second_saturday_fixed_off')
            ->where('employees.id =', $employee_id)
            ->first();

SELECT `leave_requests`.*, trim(concat(e.first_name, " ", e.last_name)) as approved_by
FROM `leave_requests`
LEFT JOIN `employees` as `e` ON `e`.`id` = `leave_requests`.`reviewed_by`
WHERE `leave_requests`.`employee_id` = '40'
AND `leave_requests`.`status` = 'approved'
AND (
                                       (leave_requests.from_date between "2026-01-01" and "2026-01-01")
                                    or (`leave_requests`.`to_date` between "2026-01-01" and "2026-01-01")
                                    or ("2026-01-01" between `leave_requests`.`from_date` and leave_requests.to_date )
                                    )
 LIMIT 1
---
    public static function is_onLeave($date, $employee_id, $in_time__Raw, $returnType = 'data')
    {
        $LeaveRequestsModel = new LeaveRequestsModel();
        $CheckLeaveRequestRow = $LeaveRequestsModel
            ->select('leave_requests.*')
            ->select('trim(concat(e.first_name, " ", e.last_name)) as approved_by')
            ->join('employees as e', 'e.id = leave_requests.reviewed_by', 'left')
            ->where('leave_requests.employee_id =', $employee_id)
            ->where('leave_requests.status =', 'approved')
            ->where(
                '(
                                       (leave_requests.from_date between "' . $date . '" and "' . $date . '")
                                    or (leave_requests.to_date between "' . $date . '" and "' . $date . '")
                                    or ("' . $date . '" between leave_requests.from_date and leave_requests.to_date )
                                    )'
            )
            ->first();

SELECT *
FROM `od_requests`
WHERE `employee_id` = '40'
AND `status` = 'approved'
AND 
                        (
                            ( date(estimated_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(estimated_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or (date(actual_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(actual_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
---
    public static function is_onOD($date, $employee_id)
    {
        $OdRequestsModel = new OdRequestsModel();
        $ods    = $OdRequestsModel
            ->where('employee_id =', $employee_id)
            ->where('status =', 'approved')
            ->where("
                        (
                            ( date(estimated_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(estimated_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( date(actual_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(actual_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
                    ")
            ->findAll();

SELECT *
FROM `od_requests`
WHERE `employee_id` = '40'
AND `international` = 'yes'
AND `status` = 'approved'
AND 
                        (
                            ( date(estimated_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(estimated_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ('2026-01-01' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or (date(actual_from_date_time) between '2026-01-01' and '2026-01-01')
                            or (date(actual_to_date_time) between '2026-01-01' and '2026-01-01')
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ('2026-01-01' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
---
    public static function is_on_InternationOD($date, $employee_id)
    {
        $OdRequestsModel = new OdRequestsModel();
        $ods    = $OdRequestsModel
            ->where('employee_id =', $employee_id)
            ->where('international =', 'yes')
            ->where('status =', 'approved')
            ->where("
                        (
                            ( date(estimated_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(estimated_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( '" . $date . "' between date(estimated_from_date_time) and date(estimated_to_date_time) )
                            or ( date(actual_from_date_time) between '" . $date . "' and '" . $date . "')
                            or ( date(actual_to_date_time) between '" . $date . "' and '" . $date . "')
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                            or ( '" . $date . "' between date(actual_from_date_time) and date(actual_to_date_time) )
                        )
                    ")
            ->findAll();

SELECT *
FROM `employees`
WHERE `employees`.`id` = '40'
---
    public static function is_sandwitch($shift_id, $date, $internal_employee_id, $employee_id)
    {

        $EmployeeModel = new EmployeeModel();
        // $company_id = $EmployeeModel->find($employee_id)->first()['company_id'];
        $company_id = $EmployeeModel->find($employee_id)['company_id'];

SELECT *
FROM `shifts`
WHERE `shifts`.`id` = '1'
---
    public static function get_shift_type($shiftId)
    {
        if (empty($shiftId)) {
            return null;
        }
        $ShiftModel = new ShiftModel();
        $ShiftData = $ShiftModel->find($shiftId);