app/Pipes/ShiftRulesAndDetails.php

SELECT *
FROM `shift_attendance_rule`
WHERE `shift_id` = '1'
 LIMIT 1
---
    public function handle($data, Closure $next)
    {
        $shift_id_current_user_data = $data['current_user_data']['shift_id'];
        // $lastWorkingDate = $data['current_user_data']->date_of_leaving;

        $ShiftAttendanceRuleModel_current_user_data =  new ShiftAttendanceRuleModel();
        $ShiftAttendanceRule_current_user_data = $ShiftAttendanceRuleModel_current_user_data->where('shift_id =', $shift_id_current_user_data)->first();