app/Libraries/AttendanceProcessor.php

    protected function processEmployee($employee_row, $from, $to, $isBulkProcessing = false): void
    {

        $PreFinalSalaryModel = new PreFinalSalaryModel();
        $PreFinalSalaryModel->select('pre_final_salary.*');
        $PreFinalSalaryModel->where('pre_final_salary.employee_id =', $employee_row['id']);
        $PreFinalSalaryModel->where("pre_final_salary.month =", date('m', strtotime($from)));
        $PreFinalSalaryModel->where("pre_final_salary.year =", date('Y', strtotime($from)));
        $FinalSalary = $PreFinalSalaryModel->first();
---
SELECT `pre_final_salary`.*
FROM `pre_final_salary`
WHERE `pre_final_salary`.`employee_id` = '40'
AND `pre_final_salary`.`month` = '01'
AND `pre_final_salary`.`year` = '2026'
 LIMIT 1